app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at desc LIMIT 20 OFFSET 0
---
  def index
    @pins = Pin.order("created_at desc").page(params[:page]).per_page(20)

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = 1 AND "pins"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
  @pin = current_user.pins.find(params[:id])

INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 10 Oct 2013 18:36:58 UTC +00:00], ["description", "Butternut"], ["updated_at", Thu, 10 Oct 2013 18:36:58 UTC +00:00], ["user_id", 1]]
---
  def create
  @pin = current_user.pins.new(params[:pin])

    respond_to do |format|
      if @pin.save

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = 1 AND "pins"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "pins" SET "image_file_name" = 'IMG_0623.jpg', "image_file_size" = 2106532, "image_updated_at" = '2013-10-10 20:45:32.128020', "updated_at" = '2013-10-10 20:45:32.128721' WHERE "pins"."id" = 4
---
  def update
  @pin = current_user.pins.find(params[:id])

    respond_to do |format|
      if @pin.update_attributes(params[:pin])

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = 1 AND "pins"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 3]]
---
  def destroy
  @pin = current_user.pins.find(params[:id])
  @pin.destroy